Revit 2015 API
DimensionTypeSet.ForwardIterator Method
Retrieve a forward moving iterator to the set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Syntax
C#
public virtual DimensionTypeSetIterator ForwardIterator()
Visual Basic
Public Overridable Function ForwardIterator As DimensionTypeSetIterator
Visual C++
public:
virtual DimensionTypeSetIterator^ ForwardIterator()
Return Value
Returns a forward moving iterator to the set.
See Also
DimensionTypeSet Class
Autodesk.Revit.DB Namespace